"""Даны два числа A и B. Вам нужно вычислить их сумму A+B.
В этой задаче для работы с входными и выходными данными вы можете использовать и файлы и потоки на ваше усмотрение."""

a,b = map(int, input().split())
print (a+b)
